# AddedElementsNotSamePhaseAsAssembly Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..AddedElementsNotSamePhaseAsAssembly Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
Selected Element(s) cannot be added to the assembly. Elements must have the same phases as the assembly to be included in the assembly.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AddedElementsNotSamePhaseAsAssembly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AddedElementsNotSamePhaseAsAssembly As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AddedElementsNotSamePhaseAsAssembly {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace